    /******************************************************************************
    
                                  Online C++ Compiler.
                   Code, Compile, Run and Debug C++ program online.
    Write your code in this editor and press "Run" button to compile and execute it.
    
    *******************************************************************************/
    
    #include <iostream>
    #include <cmath>
    
    using namespace std;
    
    int main()
    {
        cout << "Перше задання: " << endl;
        int n;  //ініціалізація змінних
        cout << " Введіть трьохзначне число: ";
        cin >> n; //Присвоєння значення змінній
        if(n>999 || n< -999){ //Умова за якою число має бути трьохзначним
            cout << "Ви ввели неправильне число";
            return 0;
        } 
        cout << "Останнє число (одиниці): " << n % 10 << endl; //Виведення першого результату
        cout << "Число посередені (десятки): " << n % 100 - n%10<< endl;  //Виведення другого результату
        cout<< "Друге завдання: "<<endl;
        int a,b,c;//ініціалізація змінних
        cout << "Введіть перше будь-якие число: ";
        cin >> a; 
        cout << "Введіть друге будь-якие число: ";
        cin >> b;
        cout << "Введіть трете будь-якие число: ";
        cin >> c;
        if((a <b && b <c) || (a>b && b>c)){ // Умова за якою число b має бути посередені
            cout << "Число b знаходиться посередені: "<<endl;
        }
        else{ // Дії у вимадку якщо умова не виконується
            cout << "Число b не знаходиться посередені: " <<endl;
        }
        cout<< "Третє завдання: "<<endl;
        int x;//ініціалізація змінних
        cout << "Введіть значення для x: ";
        cin >> x;
        
        double m = (sin(2 * x) * 2 * (1 - 2 * x)) / (tan(x) * sin(48.0 * M_PI / 180.0)) + log2(x^2); //Вирішення рівняння
        cout << "Результат обчислення: " <<m;
        return 0;
    }
